
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hito1991/aws-ecs-terraform/actions/runs/7276818465)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-054815ee42e698c78]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0b757b327cfadf5bc]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0322d3fc7701247b9]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-02373311b2da3577e]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-09b6624041ec92195]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0c809db5600d00892]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-08523ac720dda1864]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0618c79d2329f7595]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0369ec0e37dc36ad9]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-04b70642bce536260]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0312259101dd7ed7a]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-01eb1db15aa20540b]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-09e8979b16fa91f08]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0d8732445b2c7e42b]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-03bff2c6743ffb031]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08256c2b81bd646e1]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-09e3dc784389d9586]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0312259101dd7ed7a1080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0ad6fcdea1e056c91]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0956d55a039c2db70]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0ecfb5f7cfdfa1bde]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0c809db5600d008921080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-09b6624041ec921951080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "For ALB."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from ALL."
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "go-simple-server-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-alb"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-alb"
        }
      + vpc_id                 = "vpc-054815ee42e698c78"
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "For ECS."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "go-simple-server-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-ecs"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-ecs"
        }
      + vpc_id                 = "vpc-054815ee42e698c78"
    }

  # aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow 8080 from Security Group for ALB."
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_security_group.ecs: Creating...
aws_security_group.alb: Creating...
aws_security_group.ecs: Creation complete after 4s [id=sg-04141638f33bbb89a]
aws_security_group.alb: Creation complete after 4s [id=sg-02df84af4230ab692]
aws_security_group_rule.ecs_from_alb: Creating...
aws_security_group_rule.ecs_from_alb: Creation complete after 1s [id=sgrule-3377403824]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":7,"Program":"tfcmt","SHA1":"da986efbfb0a542da5cac529bc03c674c8c58220","Vars":{},"WorkflowName":"Terraform"} -->